      *****************************************************************
      * GN1CTR - CONTATORI DETERMINISTICI ONLINE
      *****************************************************************
       01  GN1-CTR.
           05 CT-RECV               PIC 9(9) COMP VALUE 0.
           05 CT-SEND               PIC 9(9) COMP VALUE 0.
           05 CT-DLI                PIC 9(9) COMP VALUE 0.
           05 CT-SKIP               PIC 9(9) COMP VALUE 0.
           05 CT-ERR                PIC 9(9) COMP VALUE 0.
