       01 GNDLIIF-AREA.
          05 GDI-FUNC            PIC X(04).
          05 GDI-DDNAME          PIC X(08).
          05 GDI-KEY             PIC X(30).
          05 GDI-PAYLOAD         PIC X(300).
          05 GDI-STATUS          PIC X(02).