      *****************************************************************
      * GN370-FAMILY-LINK.CPY
      *****************************************************************
       01  FAMILY-LINK-REC.
           05  FL-LINK-ID             PIC X(12).
           05  FL-FAMILY-ID           PIC X(12).
           05  FL-PERSON-ID           PIC X(12).
           05  FL-ROLE                PIC X(10).
           05  FL-LINK-DATE           PIC X(10).