      *****************************************************************
      * GN370-MEDIA-LINK.CPY
      *****************************************************************
       01  MEDIA-LINK-REC.
           05  ML-ID                  PIC X(12).
           05  ML-MEDIA-ID            PIC X(12).
           05  ML-ENTITY-TYPE         PIC X(15).
           05  ML-ENTITY-ID           PIC X(12).
           05  ML-IS-PRIMARY          PIC X(1).
           05  ML-CAPTION             PIC X(200).