      *****************************************************************
      * GN370-PERSON-EVENT.CPY
      *****************************************************************
       01  PERSON-EVENT-REC.
           05  PE-ID                  PIC X(12).
           05  PE-PERSON-ID           PIC X(12).
           05  PE-EVENT-ID            PIC X(12).
           05  PE-ROLE-IN-EVENT       PIC X(20).