      *****************************************************************
      * GN370-PERSON-HOUSE.CPY
      *****************************************************************
       01  PERSON-HOUSE-REC.
           05  PH-ID                  PIC X(12).
           05  PH-PERSON-ID           PIC X(12).
           05  PH-HOUSE-ID            PIC X(12).
           05  PH-ROLE-IN-HOUSE       PIC X(15).
           05  PH-DATE-FROM           PIC X(10).
           05  PH-DATE-TO             PIC X(10).