       01 GNSTATC-CODES.
          05 GNS-OK              PIC X(02) VALUE "  ".
          05 GNS-NOTFND          PIC X(02) VALUE "GE".
          05 GNS-END             PIC X(02) VALUE "GB".
          05 GNS-DUP             PIC X(02) VALUE "II".
          05 GNS-AUTH            PIC X(02) VALUE "DA".
          05 GNS-ABEND           PIC X(02) VALUE "12".