      *****************************************************************
      * GN370-TITLE.CPY
      *****************************************************************
       01  TITLE-REC.
           05  TITLE-ID               PIC X(12).
           05  TITLE-CODE             PIC X(20).
           05  TITLE-NAME             PIC X(100).
           05  TITLE-CATEGORY         PIC X(15).
           05  TITLE-REALM            PIC X(100).
           05  TITLE-NOTES            PIC X(300).