       IDENTIFICATION DIVISION.
       PROGRAM-ID. IGBAT01.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY GNPERSN.
       COPY GNFAMIL.
       COPY GNSTATC.
       PROCEDURE DIVISION.
           GOBACK.