       IDENTIFICATION DIVISION.
       PROGRAM-ID. GNUTIL01.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY GNSTATC.
       COPY GNDLIIF.
       PROCEDURE DIVISION.
           GOBACK.