       IDENTIFICATION DIVISION.
       PROGRAM-ID. TX2GED.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY "TX2-GEDCOM-IO.cpy".

       PROCEDURE DIVISION.
       MAIN.
           IF IN-AZIONE-GEDCOM = SPACES
              MOVE 12 TO OUT-COD-ESITO
              MOVE "AZIONE GEDCOM OBBLIGATORIA" TO OUT-MSG-ESITO
              GOBACK
           END-IF
           MOVE 0 TO OUT-COD-ESITO
           MOVE "OK" TO OUT-MSG-ESITO
           GOBACK.
       END PROGRAM TX2GED.
