       IDENTIFICATION DIVISION.
       PROGRAM-ID. TX2PER.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY "TX2-PER-IO.cpy".

       PROCEDURE DIVISION.
       MAIN.
           IF IN-ID-PERSONA = SPACES
              MOVE 12 TO OUT-COD-ESITO
              MOVE "ID PERSONA OBBLIGATORIO" TO OUT-MSG-ESITO
              GOBACK
           END-IF
           MOVE 0 TO OUT-COD-ESITO
           MOVE "OK" TO OUT-MSG-ESITO
           GOBACK.
       END PROGRAM TX2PER.
