       01 LK-CLI-ARGS.
          05 LK-CMD            PIC X(16).
          05 LK-PARAM          PIC X(120).
          05 LK-RETURN-CODE    PIC S9(4) COMP.
