//GNVALJOB JOB CLASS=A,MSGCLASS=H
//STEP01   EXEC PGM=IGBAT01,PSB=GN37PSB
//PERSON   DD  DSN=DSN/MASTER/PERSON.dat,DISP=SHR
//FAMILY   DD  DSN=DSN/MASTER/FAMILY.dat,DISP=SHR
//PEREVT   DD  DSN=DSN/LINK/PEREVT.lnk,DISP=SHR
//FAMCHD   DD  DSN=DSN/LINK/FAMCHD.lnk,DISP=SHR
//CITATN   DD  DSN=DSN/LINK/CITATN.lnk,DISP=SHR
//SYSPRINT DD  DSN=SPOOL/GNVALJOB/STEP01.SYSPRINT,DISP=NEW
//SYSOUT   DD  DSN=SPOOL/GNVALJOB/STEP01.SYSOUT,DISP=NEW
//SYSIN    DD  DSN=CNTL/SYSIN/GNVALIN.ctl,DISP=SHR
//*