      * DCLGEN GENERATO DA DDL - NON MODIFICARE
       01 REC-ARALDICA.
           05 DB-ID-ARALDICA               PIC X(32).
           05 DB-ID-FAMIGLIA               PIC X(32).
           05 DB-BLASONATURA               PIC X(512).
           05 DB-URL-STEMMA                PIC X(256).
           05 DB-NOTE-ARALDICA             PIC X(512).
