      * DCLGEN GENERATO DA DDL - NON MODIFICARE
       01 REC-FAMIGLIE.
           05 DB-ID-FAMIGLIA               PIC X(32).
           05 DB-NOME-FAMIGLIA             PIC X(80).
           05 DB-CATEGORIA-FAMIGLIA        PIC X(32).
           05 DB-BLASONATURA               PIC X(512).
           05 DB-NOTE-FAMIGLIA             PIC X(512).
