      * DCLGEN GENERATO DA DDL - NON MODIFICARE
       01 REC-FIGLIAZIONI.
           05 DB-ID-FIGLIAZIONE            PIC X(32).
           05 DB-ID-FIGLIO                 PIC X(32).
           05 DB-ID-GENITORE               PIC X(32).
           05 DB-RELAZIONE-PARENTELA       PIC X(16).
           05 DB-NOTE-FIGLIAZIONE          PIC X(512).
