      * DCLGEN GENERATO DA DDL - NON MODIFICARE
       01 REC-FONTI.
           05 DB-ID-FONTE                  PIC X(32).
           05 DB-TIPO-FONTE                PIC X(40).
           05 DB-RIFERIMENTO-FONTE         PIC X(256).
           05 DB-URL-FONTE                 PIC X(256).
           05 DB-NOTE-FONTE                PIC X(512).
