      * DCLGEN GENERATO DA DDL - NON MODIFICARE
       01 REC-MATRIMONI.
           05 DB-ID-MATRIMONIO             PIC X(32).
           05 DB-ID-PERSONA-SPOSO          PIC X(32).
           05 DB-ID-PERSONA-SPOSA          PIC X(32).
           05 DB-DATA-MATRIMONIO           PIC X(10).
           05 DB-LUOGO-MATRIMONIO          PIC X(80).
           05 DB-NOTE-MATRIMONIO           PIC X(512).
