      * DCLGEN GENERATO DA DDL - NON MODIFICARE
       01 REC-PERSONE.
           05 DB-ID-PERSONA                PIC X(32).
           05 DB-NOME                      PIC X(60).
           05 DB-COGNOME                   PIC X(60).
           05 DB-DATA-NASCITA              PIC X(10).
           05 DB-LUOGO-NASCITA             PIC X(80).
           05 DB-NOTE                      PIC X(512).
