      * DCLGEN GENERATO DA DDL - NON MODIFICARE
       01 REC-PROPRIETA.
           05 DB-ID-PROPRIETA              PIC X(32).
           05 DB-ID-FAMIGLIA               PIC X(32).
           05 DB-NOME-PROPRIETA            PIC X(120).
           05 DB-LOCALITA                  PIC X(120).
           05 DB-TIPOLOGIA                 PIC X(40).
           05 DB-NOTE-PROPRIETA            PIC X(512).
