      * DCLGEN GENERATO DA DDL - NON MODIFICARE
       01 REC-TITOLI.
           05 DB-ID-TITOLO                 PIC X(32).
           05 DB-ID-PERSONA                PIC X(32).
           05 DB-ID-FAMIGLIA               PIC X(32).
           05 DB-NOME-TITOLO               PIC X(80).
           05 DB-GRADO-TITOLO              PIC X(40).
           05 DB-NOTE-TITOLO               PIC X(512).
