      * COPY TX2 DB I/O
       01 TX2-DB-IO.
          05 IN-TIPO-OPERAZIONE        PIC X(20).
          05 IN-ENTITA-DATI            PIC X(16).
          05 IN-ID-PERSONA             PIC X(32).
          05 IN-ID-FAMIGLIA            PIC X(32).
          05 OUT-COD-ESITO             PIC 9(4).
          05 OUT-MSG-ESITO             PIC X(120).
          05 OUT-NUM-RIGHE             PIC 9(4).
