      * COPY TX2 FAM I/O
       01 TX2-FAM-IO.
          05 IN-ID-FAMIGLIA            PIC X(32).
          05 IN-CATEGORIA-FAMIGLIA     PIC X(32).
          05 OUT-COD-ESITO             PIC 9(4).
          05 OUT-MSG-ESITO             PIC X(120).
