      * COPY TX2 PER I/O
       01 TX2-PER-IO.
          05 IN-ID-PERSONA             PIC X(32).
          05 IN-TIPO-VISTA             PIC X(16).
          05 OUT-COD-ESITO             PIC 9(4).
          05 OUT-MSG-ESITO             PIC X(120).
