      * GN370-HOUSE-REC.cpy VERSION 2.0
       01 GN370-HOUSE-REC.
          05 GNH-HOUSE-ID           PIC X(12).
          05 GNH-HOUSE-NAME         PIC X(100).
          05 GNH-PARENT-HOUSE-ID    PIC X(12).
          05 GNH-NOBLE-RANK         PIC X(30).
          05 GNH-NOTES              PIC X(500).
