      * GN370-TITLE-REC.cpy VERSION 2.0
       01 GN370-TITLE-REC.
          05 GNT-TITLE-ID           PIC X(12).
          05 GNT-TITLE-NAME         PIC X(100).
          05 GNT-CATEGORY           PIC X(15).
          05 GNT-REALM              PIC X(100).
