      * GN370-PERSON-HOUSE-REC.cpy VERSION 2.0
       01 GN370-PERSON-HOUSE-REC.
          05 GNPH-LINK-ID           PIC X(12).
          05 GNPH-PERSON-ID         PIC X(12).
          05 GNPH-HOUSE-ID          PIC X(12).
