      * GN370-EVENT-REC.cpy VERSION 2.0
       01 GN370-EVENT-REC.
          05 GNE-EVENT-ID           PIC X(12).
          05 GNE-PERSON-ID          PIC X(12).
          05 GNE-EVENT-TYPE         PIC X(15).
          05 GNE-EVENT-DATE         PIC X(10).
          05 GNE-EVENT-DATE-END     PIC X(10).
          05 GNE-EVENT-DATE-QUAL    PIC X(01).
