      * GN370-TITLE-ASSIGNMENT-REC.cpy VERSION 2.0
       01 GN370-TITLE-ASSIGNMENT-REC.
          05 GNTA-TA-ID             PIC X(12).
          05 GNTA-PERSON-ID         PIC X(12).
          05 GNTA-TITLE-ID          PIC X(12).
          05 GNTA-DATE-FROM         PIC X(10).
          05 GNTA-DATE-TO           PIC X(10).
