      * GN370-PLACE-REC.cpy VERSION 2.0
       01 GN370-PLACE-REC.
          05 GNL-PLACE-ID           PIC X(12).
          05 GNL-PLACE-NAME         PIC X(100).
          05 GNL-PARENT-ID          PIC X(12).
          05 GNL-NOTES              PIC X(300).
