      * GN370-JOURNAL-REC.cpy VERSION 2.0
       01 GN370-JOURNAL-REC.
          05 GNJ-JOURNAL-ID         PIC X(12).
          05 GNJ-ENTRY-TS           PIC X(14).
          05 GNJ-OP-TYPE            PIC X(20).
          05 GNJ-ENTITY-TYPE        PIC X(20).
          05 GNJ-ENTITY-ID          PIC X(12).
          05 GNJ-DESCRIPTION        PIC X(500).
