      * GN370-HERALD-REC.cpy VERSION 2.0
       01 GN370-HERALD-REC.
          05 GNH-HERALD-ID          PIC X(12).
          05 GNH-HOUSE-ID           PIC X(12).
          05 GNH-BLAZON-ITA         PIC X(500).
          05 GNH-BLAZON-LAT         PIC X(500).
          05 GNH-SVG-FILENAME       PIC X(200).
