      * GN370-MEDIA-REC.cpy VERSION 2.0
       01 GN370-MEDIA-REC.
          05 GNM-MEDIA-ID           PIC X(12).
          05 GNM-ENTITY-TYPE        PIC X(20).
          05 GNM-ENTITY-ID          PIC X(12).
          05 GNM-FILENAME           PIC X(200).
          05 GNM-IS-VECTOR          PIC X(01).
