      * GN370-SEAL-REC.cpy VERSION 2.0
       01 GN370-SEAL-REC.
          05 GNS-SEAL-ID            PIC X(12).
          05 GNS-ENTITY-TYPE        PIC X(20).
          05 GNS-ENTITY-ID          PIC X(12).
          05 GNS-SVG-FILENAME       PIC X(200).
