      * GN370-PERSON-EVENT-REC.cpy VERSION 2.0
       01 GN370-PERSON-EVENT-REC.
          05 GNPE-LINK-ID           PIC X(12).
          05 GNPE-PERSON-ID         PIC X(12).
          05 GNPE-EVENT-ID          PIC X(12).
