      * GN370-FAMILY-REC.cpy VERSION 2.0
       01 GN370-FAMILY-REC.
          05 GNF-FAMILY-ID          PIC X(12).
          05 GNF-FATHER-ID          PIC X(12).
          05 GNF-MOTHER-ID          PIC X(12).
          05 GNF-UNION-DATE         PIC X(10).
          05 GNF-UNION-DATE-QUAL    PIC X(01).
