      * GN370-CITATION-REC.cpy VERSION 2.0
       01 GN370-CITATION-REC.
          05 GNC-CITATION-ID        PIC X(12).
          05 GNC-SOURCE-ID          PIC X(12).
          05 GNC-PERSON-ID          PIC X(12).
          05 GNC-NOTE               PIC X(300).
