      * GN370-SOURCE-REC.cpy VERSION 2.0
       01 GN370-SOURCE-REC.
          05 GNS-SOURCE-ID          PIC X(12).
          05 GNS-TITLE              PIC X(200).
          05 GNS-AUTHOR             PIC X(100).
          05 GNS-NOTES              PIC X(500).
