       01 PERSON-REC.
          05 PERSON-ID         PIC X(16).
          05 FULL-NAME         PIC X(64).
          05 SEX               PIC X(1).
          05 BIRTH-DATE        PIC X(10).
          05 BIRTH-PLACE       PIC X(64).
          05 DEATH-DATE        PIC X(10).
          05 DEATH-PLACE       PIC X(64).
          05 FS-ID             PIC X(16).
          05 NOTES             PIC X(240).
